tony-cloud/STM32_duino/cores/arduino/stm32_HAL/stm32XXxxx_ll_rtc.h

#pragma GCC diagnostic push
#pragma GCC diagnostic ignored "-Wunused-parameter"

#include "stm32XXxxx_ll_rcc.h"


#ifdef STM32F0
	#include "stm32f0xx_ll_rtc.h"
	#include "stm32f0xx_ll_pwr.h"
	#include "stm32f0xx_ll_utils.h"
	#include "stm32f0xx_ll_cortex.h"
#endif
#ifdef STM32F1
	#include "stm32f1xx_ll_rtc.h"
	#include "stm32f1xx_ll_pwr.h"
	#include "stm32f1xx_ll_utils.h"
	#include "stm32f1xx_ll_cortex.h"
#endif
#ifdef STM32F2
	#include "stm32f2xx_ll_rtc.h"
	#include "stm32f2xx_ll_pwr.h"
	#include "stm32f2xx_ll_utils.h"
	#include "stm32f2xx_ll_cortex.h"
#endif
#ifdef STM32F3
	#include "stm32f3xx_ll_rtc.h"
	#include "stm32f3xx_ll_pwr.h"
	#include "stm32f3xx_ll_utils.h"
	#include "stm32f3xx_ll_cortex.h"
#endif
#ifdef STM32F4
	#include "stm32f4xx_ll_rtc.h"
	#include "stm32f4xx_ll_pwr.h"
	#include "stm32f4xx_ll_utils.h"
	#include "stm32f4xx_ll_cortex.h"
#endif
#ifdef STM32F7
	#include "stm32f7xx_ll_rtc.h"
	#include "stm32f7xx_ll_pwr.h"
	#include "stm32f7xx_ll_utils.h"
	#include "stm32f7xx_ll_cortex.h"
#endif
#ifdef STM32H7
//	#include "stm32h7xx_ll_rtc.h"
//	#include "stm32h7xx_ll_pwr.h"
//	#include "stm32h7xx_ll_utils.h"
//	#include "stm32h7xx_ll_cortex.h"
#endif
#ifdef STM32L0
	#include "stm32l0xx_ll_rtc.h"
	#include "stm32l0xx_ll_pwr.h"
	#include "stm32l0xx_ll_utils.h"
	#include "stm32l0xx_ll_cortex.h"
#endif
#ifdef STM32L1
	#include "stm32l1xx_ll_rtc.h"
	#include "stm32l1xx_ll_pwr.h"
	#include "stm32l1xx_ll_utils.h"
	#include "stm32l1xx_ll_cortex.h"
#endif
#ifdef STM32L4
 	#include "stm32l4xx_ll_rtc.h"
	#include "stm32l4xx_ll_pwr.h"
	#include "stm32l4xx_ll_utils.h"
	#include "stm32l4xx_ll_cortex.h"
#endif

#pragma GCC diagnostic pop
